Repository: Tencent-RTC/TUIKit_iOS
Catalog: application/login/Resource/LoginLocalized.xcstrings
Source language: en
Languages: ja, zh_hans

# login_dev_select_mode
source: Select Login Method
ja: ログイン方法を選択
zh_hans: 选择登录方式

# login_menu_auto_login
source: Auto Login
ja: 自動ログイン
zh_hans: 自动登录

# login_menu_debug
source: Debug Login
ja: デバッグログイン
zh_hans: Debug 登录

# login_menu_debug_desc
source: Enter userId directly (skip verification)
ja: userIdを直接入力してログイン（認証コードをスキップ）
zh_hans: 直接输入 userId 登录（跳过验证码）

# login_menu_email
source: Email Login
ja: メールログイン
zh_hans: 邮箱登录

# login_menu_email_desc
source: Email + Verification Code, for overseas version
ja: メール＋認証コード、海外版向け
zh_hans: 邮箱 + 验证码，适用于海外版

# login_menu_invite
source: Invite Code Login
ja: 招待コードログイン
zh_hans: 邀请码登录

# login_menu_invite_desc
source: Login directly with invite code
ja: 招待コードで直接ログイン
zh_hans: 通过邀请码直接登录

# login_menu_ioa
source: iOA Enterprise Login
ja: iOA企業ログイン
zh_hans: iOA 企业登录

# login_menu_ioa_desc
source: Login via iOA SDK ticket
ja: iOA SDKチケットでログイン
zh_hans: 通过 iOA SDK 票据登录

# login_menu_phone
source: Phone Login
ja: 電話番号ログイン
zh_hans: 手机号登录

# login_menu_phone_desc
source: Phone + Verification Code, switchable to iOA
ja: 電話番号＋認証コード、iOAに切替可能
zh_hans: 手机号 + 验证码，页面内可切换至 iOA

# login_menu_env_production
source: Production
ja: 本番環境
zh_hans: 正式环境

# login_menu_env_test
source: Test
ja: テスト環境
zh_hans: 测试环境

# login_menu_env_changed_restart
source: Environment has changed. To avoid issues from switching back and forth, please restart the app.
ja: 環境が変更されました。環境の切り替えによる問題を避けるため、アプリを再起動してください。
zh_hans: 环境已经改变，为排除来回切环境可能导致的问题，请重启app

# login_email_welcome_title
source: Welcome to RTC
ja: RTCへようこそ
zh_hans: 欢迎使用 RTC

# login_email_welcome_subtitle
source: Enter your email to get an invitation code.
ja: メールアドレスを入力して招待コードを取得してください。
zh_hans: 请输入您的邮箱以获取邀请码。

# login_email_welcome_hint
source: Email address
ja: メールアドレス
zh_hans: 邮箱地址

# login_email_welcome_continue
source: Continue
ja: 続ける
zh_hans: 继续

# login_email_welcome_has_invite_code
source: Already have an invitation code?
ja: 招待コードをお持ちですか？
zh_hans: 已有邀请码？

# login_email_welcome_enter_code
source: Enter code
ja: コードを入力
zh_hans: 输入邀请码

# login_terms_of_service
source: Terms of Service
ja: 《サービス利用規約》
zh_hans: 《服务条款》

# login_terms_privacy_policy
source: Privacy Policy
ja: 《プライバシーポリシー》
zh_hans: 《隐私政策》

# login_invite_terms_agreement
source: I agree to TRTC's xxx and yyy
ja: TRTCのxxxとyyyに同意します
zh_hans: 我同意 TRTC 的xxx和yyy

# login_email_invite_code_title
source: Check Your Email
ja: メールをご確認ください
zh_hans: 检查您的邮箱

# login_email_invite_code_subtitle
source: Please enter the invitation code we have sent to your email xxx
ja: xxxに送信した招待コードを入力してください
zh_hans: 请输入我们发送到您邮箱 xxx 的邀请码

# login_email_invite_code_error
source: The invitation code is incorrect
ja: 招待コードが正しくありません
zh_hans: 邀请码不正确

# login_email_invite_code_verifying
source: Validating...
ja: 検証中...
zh_hans: 验证中...

# login_email_invite_code_resend
source: Resend code
ja: 招待コードを再送信
zh_hans: 重新发送邀请码

# login_email_invite_code_resend_hint
source: Resend code in xxxs.
ja: xxx秒後に招待コードを再送信します。
zh_hans: xxx秒后重新发送邀请码。

# login_email_invite_code_get_started
source: Get Started
ja: はじめる
zh_hans: 开始使用

# login_email_invite_code_marketing
source: I'd like to receive marketing information from TRTC
ja: TRTCからのマーケティング情報の受信に同意します
zh_hans: 我同意接收 TRTC 的营销推广信息

# login_email_invite_code_terms_tooltip
source: Agree to the terms before use.
ja: ご利用前にサービス規約に同意してください。
zh_hans: 请先同意服务条款后使用

# login_invite_title
source: Enter Invitation Code
ja: 招待コードを入力
zh_hans: 输入邀请码

# login_invite_subtitle
source: If you already have an invitation code, please enter here to get started
ja: 招待コードをお持ちの方はこちらに入力して開始してください
zh_hans: 如果您已有邀请码，请在此处输入以开始使用

# login_invite_enter_complete
source: Please enter the complete 6-digit invitation code
ja: 6桁の招待コードを入力してください
zh_hans: 请输入完整的6位邀请码

# login_privacy_user_agreement
source: 《Terms of Use》
ja: 《利用規約》
zh_hans: 《用户协议》

# login_privacy_summary_link
source: 《Privacy Policy Summary》
ja: 《プライバシーポリシー概要》
zh_hans: 《隐私政策摘要》

# login_privacy_protection_guide
source: 《Privacy Protection Guide》
ja: 《プライバシーポリシー》
zh_hans: 《隐私保护指引》

# login_privacy_data_collection_list
source: 《Personal Information Collected》
ja: 《個人情報収集一覧》
zh_hans: 《个人信息收集清单》

# login_privacy_third_share_list
source: 《Information Shared with Third Parties》
ja: 《第三者情報共有一覧》
zh_hans: 《第三方信息共享清单》

# login_privacy_read_agreement
source: I have read and agree to the xxx, yyy and zzz
ja: xxx、yyyおよびzzzを読み、同意しました
zh_hans: 我已阅读并同意 xxx、yyy和zzz

# login_privacy_alert_description
source: Welcome to TRTC. The xxx and yyy agreements detail how we collect, use, and store your information, as well as the rights your are entitled to and how to exercise them. By tapping the button below, you agree to the content of the agreements.
ja: Tencent Cloud TRTC へようこそ。xxxとyyyにより、個人情報の収集、使用、保存について、またお客様の権利とその行使方法についてご確認いただけます。同意される場合は下のボタンをタップしてサービスをご利用ください。
zh_hans: 欢迎您使用腾讯云音视频（TRTC），我们将通过 xxx和yyy 帮助您了解我们收集、使用、存储个人信息的情况，此外您还可以了解到您所享有的相关权利和实现途径，如您同意请点击下方按钮开始接受我们的服务；

# login_privacy_alert_full_content
source: xxx is a product provided by Shenzhen Tencent Computer System Co., Ltd. (35th Floor, Tencent Building, Kejizhong 1st Road, Maling Community, Yuehai Street, Nanshan District, Shenzhen). It offers features including interactive live streaming, co-anchoring, karaoke, audio/video chat, and online conferencing. For a quick look at how we collect personal information, see the yyy. 1. When you sign up with or log in to RT-Cube, we collect your profile information including name, photo, mobile number, and email address. When an error occurs during your use of our services, we collect your package name, system version, and process name, among others. We collect only information essential for you to use our product and services. To learn more about the personal information we collect and how we use it, see zzz. 2. When you use features such as interactive live streaming, co-anchoring, karaoke, audio/video chat, and online conferencing, we may access your storage space, camera, photos, mic, and network, among others. We will ask for your permission the first time we access these resources. You can deny access or change the access settings. 3. Some of our services are provided by third parties. To learn about the third parties we work with and how we share information with them, see mmm. 4. You can query, copy, update, or delete your personal information, as well as withdraw your consent for data collection. You can also delete your account. To learn more about your rights over your personal information, see Part 5 of the nnn. 5. If you have any questions, contact us at Dataprivacy@tencent.com or via other channels provided in the nnn.
ja: xxxは、深圳市テンセントコンピュータシステム有限公司（登録住所：深圳市南山区粤海街道麻嶺社区科技中一路テンセントビル35階）が提供するインタラクティブライブ配信、連麦PK、カラオケ、音声チャット、ビデオチャット、オンライン会議等の機能製品です。個人情報の収集方法について簡潔に知りたい場合は、yyyをご参照ください。 1、 アカウント登録・ログイン時に、ニックネーム、アバター、電話番号、メールアドレスを収集します。これらはアカウント登録・ログインおよびセキュリティ保護のためです。異常報告時にはパッケージ名、バージョン、プロセス名等を収集します。詳細はzzzをご確認ください。 2、 インタラクティブライブ配信、連麦PK、カラオケ等の機能使用時に、ストレージ、カメラ、写真、マイク、ネットワーク等の権限を使用する場合があります。初回使用時に許可を求め、拒否または取消が可能です。 3、 一部サービスは第三者が提供しています。詳細はmmmをご確認ください。 4、 個人情報の照会、コピー、訂正、補充、削除、撤回が可能です。アカウント削除も提供しています。詳細はnnnの第5条をご確認ください。 5、 ご質問はDataprivacy@tencent.comまたはnnnに記載の方法でお問い合わせください。
zh_hans: xxx产品是由深圳市腾讯计算机系统有限公司（注册地为深圳市南山区粤海街道麻岭社区科技中一路腾讯大厦 35 层）提供的互动直播、连麦PK、K歌、语音聊天、视频聊天、在线会议等功能产品。如果需要快速、扼要了解我们如何收集您的信息，可以参考 yyy。 1、 当您注册、登录腾讯云音视频账号时，我们会收集您的昵称、头像、手机号码、邮箱，收集这些信息是为了帮助您完成腾讯云音视频账号的注册和登陆保护您账户的安全；当您使用过程中出现异常上报情况时，我们将收集您的包名、版本、所属进程名等信息。我们仅会根据您使用我们产品与服务的具体功能需求，收集必要的用户信息。您可查阅 zzz 快速了解我们收集和使用您个人信息的情况。 2、 当您使用互动直播、连麦PK、K歌、语音聊天、视频聊天、在线会议等功能时，我们可能会调用您的存储、相机、相册、麦克风、网络、音频等权限。我们将在首次调用时询问您是否允许使用该权限，您有权拒绝或取消授权。 3、 我们的部分服务可能需要第三方来提供，您可查阅 mmm 快速了解第三方共享信息及第三方SDK情况。 4、 您可以查询、复制、更正、补充、删除或撤回您的个人信息，我们也为您提供注销账户的渠道。您可以通过 nnn 第5条所列途径及方式快速了解您作为个人信息权利主体的其他权利。 5、如您对以上内容有任何疑问，可以通过发邮件至Dataprivacy@tencent.com或 nnn 中列出的其他方式与我们联系。

# login_privacy_alert_content_agree
source: If you agree to the xxx, yyy, zzz, and mmm, click Agree to start using our product and services.
ja: xxx、yyy、zzzおよびmmmに同意される場合は、「同意」をタップしてサービスをご利用ください。
zh_hans: 如您同意 xxx、yyy、zzz以及mmm，请点击“同意”，开始使用我们的产品和服务。

# login_privacy_agree_continue
source: Agree & Continue
ja: 同意して続ける
zh_hans: 同意并继续

# login_privacy_read_conditions
source: Acceptance of Terms and Conditions
ja: 以下の規約をお読みになり同意してください
zh_hans: 请阅读并同意以下条款

# login_error_send_failed
source: Send failed. Please try again later.
ja: 送信に失敗しました。後でもう一度お試しください。
zh_hans: 发送失败，请稍后重试

# login_error_login_failed
source: Login failed. Please try again later.
ja: ログインに失敗しました。後でもう一度お試しください。
zh_hans: 登录失败，请稍后重试

# login_error_iot_phone
source: This phone number is an ICCID number. Please enter another phone number to log in.
ja: この電話番号はIoTカード番号です。別の電話番号を入力してログインしてください。
zh_hans: 此手机号为物联网卡手机号，请输入其他手机号码登录。

# login_email_send_failed
source: Email sent failed
ja: メール送信に失敗しました
zh_hans: 邮件发送失败

# login_email_too_many_requests
source: Too many code-requests, please check your email for the sent codes.
ja: リクエストが多すぎます。メールに送信済みの招待コードをご確認ください。
zh_hans: 请求次数过多，请检查邮箱中已发送的邀请码。

# login_invite_code_used
source: User invite code be used
ja: 招待コードは既に使用されています
zh_hans: 邀请码已被使用

# login_invite_code_invalid
source: Invitation Code Invalid
ja: 招待コードが無効です
zh_hans: 邀请码无效

# login_invite_code_expired
source: Invitation code has expired
ja: 招待コードの有効期限が切れています
zh_hans: 邀请码已过期

# login_btn_login
source: Log In/Register
ja: ログイン/登録
zh_hans: 登录/注册

# login_phone_hint
source: Enter a mobile number
ja: 電話番号を入力
zh_hans: 请输入手机号

# login_verify_code_hint
source: Enter a verification code
ja: 認証コードを入力
zh_hans: 请输入验证码

# login_get_verify_code
source: Get
ja: 認証コードを取得
zh_hans: 获取验证码

# login_verify_code_sent
source: Verification code sent
ja: 認証コードを送信しました
zh_hans: 验证码已发送

# login_status_success
source: Login successful
ja: ログイン成功
zh_hans: 登录成功

# login_token_expired
source: Token has expired
ja: トークンの有効期限が切れています
zh_hans: Token 已过期

# login_user_cancelled
source: User cancelled login
ja: ユーザーがログインをキャンセルしました
zh_hans: 用户取消登录

# login_ioa_loading
source: Signing in with iOA...
ja: iOAでログイン中です。しばらくお待ちください...
zh_hans: iOA 登录中，请稍等...

# login_hidden_config_camera_permission_msg
source: Please enable camera access in Settings to scan QR codes.
ja: QRコードをスキャンするには、設定でカメラのアクセスを有効にしてください。
zh_hans: 请在设置中开启相机权限以扫描二维码。

# login_hidden_config_camera_permission_title
source: Camera Permission Required
ja: カメラの権限が必要です
zh_hans: 需要相机权限

# login_hidden_config_cancel
source: Cancel
ja: キャンセル
zh_hans: 取消

# login_hidden_config_confirm_switch
source: Confirm Switch
ja: 切替を確認
zh_hans: 确认切换

# login_hidden_config_go_settings
source: Go to Settings
ja: 設定へ移動
zh_hans: 前往设置

# login_hidden_config_restore_default
source: Restore Default
ja: デフォルトに戻す
zh_hans: 恢复默认

# login_hidden_config_scan_hint
source: Place QR code within the frame to scan
ja: フレーム内にQRコードを配置すると自動スキャンされます
zh_hans: 将二维码放入框内，即可自动扫描

# login_hidden_config_scan_qr
source: Scan QR Code
ja: QRコードをスキャン
zh_hans: 扫描二维码

# login_hidden_config_scan_qr_desc
source: Scan config QR code to auto-fill
ja: 設定QRコードをスキャンして自動入力
zh_hans: 扫描配置二维码自动填充

# login_profile_title
source: Register
ja: 登録
zh_hans: 注册

# login_profile_toast_register_success
source: Registered successfully
ja: 登録に成功しました
zh_hans: 注册成功

# login_profile_avatar_dialog_title
source: Change Profile Picture
ja: プロフィール画像を設定
zh_hans: 设置头像

# login_profile_avatar_dialog_confirm
source: Done
ja: 完了
zh_hans: 确认

# login_profile_nickname_hint
source: Enter a username
ja: ユーザー名を入力
zh_hans: 请输入用户名

# login_profile_nickname_limit
source: Chinese, letters, numbers, underscores, 2–20 characters
ja: 中国語、英字、数字、アンダースコアのみ、2〜20文字
zh_hans: 仅限中文、字母、数字和下划线，2-20个字

# login_profile_first_login_hint
source: This is your first login. Please complete your profile.
ja: 初回ログインのため、ユーザー情報を入力してください。
zh_hans: 首次登录请补充用户信息

# login_profile_fillin_nickname
source: Please fill in user nickname
ja: ニックネームを入力してください
zh_hans: 请填写用户昵称

# login_profile_modify_later_in_settings
source: You can modify it later in settings
ja: 設定で後から変更できます
zh_hans: 可在设置中修改

# login_common_agree
source: Agree
ja: 同意
zh_hans: 同意

# login_common_disagree
source: Disagree
ja: 同意しない
zh_hans: 不同意

# login_common_prompt
source: Information
ja: お知らせ
zh_hans: 提示

# login_language_switch
source: Switch Language
ja: 言語切替
zh_hans: 切换语言

# login_terms_and_conditions_link
source: Terms and Conditions
ja: 利用規約
zh_hans: 用户协议

# login_send_verify_code_required
source: Please send the verification code
ja: 認証コードを送信してください
zh_hans: 请发送验证码

# login_home_welcome
source: Welcome to Tencent Cloud TRTC
ja: Tencent Cloud TRTCへようこそ
zh_hans: 欢迎使用腾讯云音视频

# login_home_loading
source: Signing in，Please Waiting...
ja: ログイン中です。しばらくお待ちください...
zh_hans: 登录中，请稍等...

# login_home_ioa_text
source: Signing in with iOA
ja: iOAログイン
zh_hans: iOA 登录

# login_home_user_id_empty
source: userid is empty
ja: UserIdが空です
zh_hans: UserId是空的

# login_home_phone_or_email_empty
source: phone or email is empty
ja: 電話番号またはメールアドレスが空です
zh_hans: 电话号码或邮箱是空的

# login_home_user_overdue
source: Login expired, please login again
ja: ログイン状態が無効になりました。再度ログインしてください
zh_hans: 登录状态失效，请重新登录

# login_home_new_version
source: A new version is available
ja: 新しいバージョンがリリースされました～
zh_hans: 有新版本发布啦~

# login_home_update_now
source: Update Now
ja: 今すぐ更新
zh_hans: 现在更新

# login_home_later
source: Later
ja: 後で
zh_hans: 稍后再说

# login_home_sys_error
source: System error
ja: システムエラー
zh_hans: 系统错误

# login_profile_custom_name_1
source: Alice
ja: 天津飯
zh_hans: 天津饭

# login_profile_custom_name_2
source: Amy
ja: 餃子
zh_hans: 饺子

# login_profile_custom_name_3
source: Anne
ja: 亀仙人
zh_hans: 龟仙人

# login_profile_custom_name_4
source: Jane
ja: チチ
zh_hans: 琪琪

# login_profile_custom_name_5
source: May
ja: 孫悟空
zh_hans: 孙悟空

# login_profile_custom_name_6
source: Linda
ja: 孫悟飯
zh_hans: 孙悟饭

# login_profile_custom_name_7
source: Emma
ja: 孫悟天
zh_hans: 孙悟天

# login_profile_custom_name_8
source: Judy
ja: ベジータ
zh_hans: 贝吉塔

# login_profile_custom_name_9
source: Mary
ja: クリリン
zh_hans: 小林

# login_profile_custom_name_10
source: Susan
ja: ナルト
zh_hans: 鸣人

# login_profile_custom_name_11
source: Monica
ja: サスケ
zh_hans: 佐助

# login_profile_custom_name_12
source: Sally
ja: カカシ
zh_hans: 卡卡西

# login_profile_custom_name_13
source: Lisa
ja: サクラ
zh_hans: 小樱

# login_profile_custom_name_14
source: Barry
ja: 自来也
zh_hans: 自来也

# login_profile_custom_name_15
source: Clark
ja: 我愛羅
zh_hans: 我爱罗

# login_profile_custom_name_16
source: Henry
ja: マイト・ガイ
zh_hans: 迈特凯

# login_profile_custom_name_17
source: Peter
ja: 韓梅梅
zh_hans: 韩梅梅

# login_profile_custom_name_18
source: John
ja: 李雷雷
zh_hans: 李雷雷

# login_profile_custom_name_19
source: Andrew
ja: 桜木花道
zh_hans: 樱木花道

# login_profile_custom_name_20
source: Charles
ja: 流川楓
zh_hans: 流川枫

# login_profile_custom_name_21
source: Carl
ja: 宮城リョータ
zh_hans: 宫城良田

# login_profile_custom_name_22
source: Mark
ja: 三井寿
zh_hans: 三井寿

# login_profile_custom_name_23
source: James
ja: 赤木晴子
zh_hans: 赤木晴子

# login_profile_custom_name_24
source: Eddie
ja: 氷河
zh_hans: 冰河

# login_profile_custom_name_25
source: Bill
ja: 星矢
zh_hans: 星矢

# login_profile_custom_name_26
source: Ben
ja: 紫龍
zh_hans: 紫龙

# login_profile_custom_name_27
source: Bob
ja: 瞬
zh_hans: 瞬

# login_profile_custom_name_28
source: Cody
ja: 沙織
zh_hans: 纱织

# login_profile_custom_name_29
source: Denny
ja: サガ
zh_hans: 撒加

# login_profile_custom_name_30
source: Darwin
ja: アイオリア
zh_hans: 艾奥利亚

# login_profile_custom_name_31
source: Derek
ja: シャカ
zh_hans: 沙加

# login_profile_custom_name_32
source: Dylan
ja: 童虎
zh_hans: 童虎

# login_profile_custom_name_33
source: Edison
ja: ミロ
zh_hans: 米罗

# login_error_agreement_unavailable
source: Agreement page is currently unavailable
ja: 規約ページは現在利用できません
zh_hans: 协议页面暂时不可用

# login_error_blacklist_query_failed
source: Failed to query blacklist
ja: ブラックリストの照会に失敗しました
zh_hans: 查询黑名单失败

# login_error_captcha_config_failed
source: Failed to get captcha configuration
ja: キャプチャ設定の取得に失敗しました
zh_hans: 获取图片验证配置失败

# login_error_captcha_verify_failed
source: Verification failed: xxx (yyy)
ja: 認証に失敗しました: xxx (yyy)
zh_hans: 验证失败: xxx (yyy)

# login_error_code_empty
source: Please enter a verification code
ja: 認証コードを入力してください
zh_hans: 请输入验证码

# login_error_code_expired
source: Verification code expired. Please request a new one.
ja: 認証コードの有効期限が切れました。再取得してください。
zh_hans: 验证码已失效，请重新获取

# login_error_code_invalid
source: Incorrect verification code. Please try again.
ja: 認証コードが正しくありません。もう一度お試しください。
zh_hans: 验证码错误，请重新输入

# login_error_debug_userid_empty
source: Please enter a user ID
ja: ユーザーIDを入力してください
zh_hans: 请输入用户ID

# login_error_get_code_first
source: Please get verification code first
ja: 先に認証コードを取得してください
zh_hans: 请先获取验证码

# login_error_invite_empty
source: Please enter invite code
ja: 招待コードを入力してください
zh_hans: 请输入邀请码

# login_error_invite_login_failed
source: Invite code login failed
ja: 招待コードによるログインに失敗しました
zh_hans: 邀请码登录失败

# login_error_ioa_login_failed
source: Enterprise login failed
ja: 企業ログインに失敗しました
zh_hans: 企业登录失败

# login_error_keepalive_failed
source: Keep-alive failed
ja: キープアライブに失敗しました
zh_hans: 保活失败

# login_error_network
source: Network error, please try again
ja: ネットワークエラーです。もう一度お試しください
zh_hans: 网络错误，请重试

# login_error_network_timeout
source: Network connection timed out. Please try again.
ja: ネットワーク接続がタイムアウトしました。もう一度お試しください。
zh_hans: 网络连接超时，请重试

# login_error_request_invite_failed
source: Failed to request invite code
ja: 招待コードの申請に失敗しました
zh_hans: 申请邀请码失败

# login_error_result_parse_failed
source: Failed to parse login result
ja: ログイン結果の解析に失敗しました
zh_hans: 登录结果解析失败

# login_error_update_failed
source: Update failed. Please try again later.
ja: 更新に失敗しました。後でもう一度お試しください。
zh_hans: 更新失败，请稍后重试

# login_email_welcome_sso_text
source: Use single sign-on xxx
ja: シングルサインオンを使用 xxx
zh_hans: 使用单点登录 xxx

# login_other_methods_divider
source: iOA Login
ja: iOAログイン
zh_hans: iOA 登录

# login_email_invite_code_resent
source: Code resent
ja: 招待コードを再送信しました
zh_hans: 邀请码已重新发送

# login_email_invite_code_resending
source: Resending invitation code...
ja: 招待コードを再送信中...
zh_hans: 正在重新发送邀请码...

# login_email_invite_code_resend_clickable
source: Didn't receive the code? Check your spam folder. Resend code.
ja: コードが届きませんか？迷惑メールフォルダをご確認ください。 招待コードを再送信。
zh_hans: 没有收到邀请码？请检查垃圾邮件文件夹。 重新发送邀请码。

# login_email_invite_code_resend_countdown
source: Didn't receive the code? Check your spam folder. Resend code in xxxs
ja: コードが届きませんか？迷惑メールフォルダをご確認ください。 xxx秒後に再送信
zh_hans: 没有收到邀请码？请检查垃圾邮件文件夹。 xxx秒后重新发送

# login_profile_avatar_title
source: Choose Avatar
ja: アバターを選択
zh_hans: 选择头像

# login_profile_toast_failed_to_set
source: Failed: xxx
ja: 設定に失敗しました: xxx
zh_hans: 设置失败: xxx

# login_profile_toast_set_username
source: Set your username
ja: ユーザー名を設定してください
zh_hans: 请设置用户名

# login_email_enter_error
source: Please enter your email address
ja: メールアドレスを入力してください
zh_hans: 请输入邮箱地址

# login_email_valid_error
source: Please enter a valid email address
ja: 有効なメールアドレスを入力してください
zh_hans: 请输入有效的邮箱地址

# login_common_btn_ok
source: OK
zh_hans: 确定
